reports/ws_prem20[1]_local[0]_1ser[15pool]_3000tunn_5inst_1000user_1m_1sec.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 1000 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1000 VUs  0m00.8s/1m0s

running (0m01.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m01.8s/1m0s

running (0m02.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m02.8s/1m0s

running (0m03.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  0m03.8s/1m0s

running (0m04.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m04.8s/1m0s

running (0m05.8s), 1000/1000 VUs, 13 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  0m05.8s/1m0s

running (0m06.8s), 1000/1000 VUs, 82 complete and 0 interrupted iterations
default   [  11% ] 1000 VUs  0m06.8s/1m0s

running (0m07.8s), 1000/1000 VUs, 211 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m07.8s/1m0s

running (0m08.8s), 1000/1000 VUs, 414 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m08.8s/1m0s

running (0m09.8s), 1000/1000 VUs, 649 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  0m09.8s/1m0s

running (0m10.8s), 1000/1000 VUs, 940 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m10.8s/1m0s

running (0m11.8s), 1000/1000 VUs, 1308 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  0m11.8s/1m0s

running (0m12.8s), 1000/1000 VUs, 1559 complete and 0 interrupted iterations
default   [  21% ] 1000 VUs  0m12.8s/1m0s

running (0m13.8s), 1000/1000 VUs, 2054 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m13.8s/1m0s

running (0m14.8s), 1000/1000 VUs, 2776 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m14.8s/1m0s

running (0m15.8s), 1000/1000 VUs, 3445 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  0m15.8s/1m0s

running (0m16.8s), 1000/1000 VUs, 4266 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m16.8s/1m0s

running (0m17.8s), 1000/1000 VUs, 4877 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  0m17.8s/1m0s

running (0m18.8s), 1000/1000 VUs, 5605 complete and 0 interrupted iterations
default   [  31% ] 1000 VUs  0m18.8s/1m0s

running (0m19.8s), 1000/1000 VUs, 6396 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m19.8s/1m0s

running (0m20.8s), 1000/1000 VUs, 6666 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m20.8s/1m0s

running (0m21.8s), 1000/1000 VUs, 7475 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  0m21.8s/1m0s

running (0m22.8s), 1000/1000 VUs, 8179 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m22.8s/1m0s

running (0m23.8s), 1000/1000 VUs, 8743 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  0m23.8s/1m0s

running (0m24.8s), 1000/1000 VUs, 9427 complete and 0 interrupted iterations
default   [  41% ] 1000 VUs  0m24.8s/1m0s

running (0m25.8s), 1000/1000 VUs, 10001 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m25.8s/1m0s

running (0m26.8s), 1000/1000 VUs, 10765 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m26.8s/1m0s

running (0m27.8s), 1000/1000 VUs, 11483 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  0m27.8s/1m0s

running (0m28.8s), 1000/1000 VUs, 12231 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m28.8s/1m0s

running (0m29.8s), 1000/1000 VUs, 12947 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  0m29.8s/1m0s

running (0m30.8s), 1000/1000 VUs, 13626 complete and 0 interrupted iterations
default   [  51% ] 1000 VUs  0m30.8s/1m0s

running (0m31.8s), 1000/1000 VUs, 14336 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m31.8s/1m0s

running (0m32.8s), 1000/1000 VUs, 14857 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m32.8s/1m0s

running (0m33.8s), 1000/1000 VUs, 15432 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  0m33.8s/1m0s

running (0m34.8s), 1000/1000 VUs, 16106 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m34.8s/1m0s

running (0m35.8s), 1000/1000 VUs, 16673 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  0m35.8s/1m0s

running (0m36.8s), 1000/1000 VUs, 17244 complete and 0 interrupted iterations
default   [  61% ] 1000 VUs  0m36.8s/1m0s

running (0m37.8s), 1000/1000 VUs, 17951 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m37.8s/1m0s

running (0m38.8s), 1000/1000 VUs, 18493 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m38.8s/1m0s

running (0m39.8s), 1000/1000 VUs, 19014 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  0m39.8s/1m0s

running (0m40.8s), 1000/1000 VUs, 19675 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  0m40.8s/1m0s

running (0m41.8s), 1000/1000 VUs, 20314 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  0m41.8s/1m0s

running (0m42.8s), 1000/1000 VUs, 20839 complete and 0 interrupted iterations
default   [  71% ] 1000 VUs  0m42.8s/1m0s

running (0m43.8s), 1000/1000 VUs, 21379 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  0m43.8s/1m0s

running (0m44.8s), 1000/1000 VUs, 21734 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  0m44.8s/1m0s

running (0m45.8s), 1000/1000 VUs, 22185 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  0m45.8s/1m0s

running (0m46.8s), 1000/1000 VUs, 22776 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  0m46.8s/1m0s

running (0m47.8s), 1000/1000 VUs, 23271 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  0m47.8s/1m0s

running (0m48.8s), 1000/1000 VUs, 23828 complete and 0 interrupted iterations
default   [  81% ] 1000 VUs  0m48.8s/1m0s

running (0m49.8s), 1000/1000 VUs, 24125 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  0m49.8s/1m0s

running (0m50.8s), 1000/1000 VUs, 24757 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  0m50.8s/1m0s

running (0m51.8s), 1000/1000 VUs, 25172 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  0m51.8s/1m0s

running (0m52.8s), 1000/1000 VUs, 25628 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  0m52.8s/1m0s

running (0m53.8s), 1000/1000 VUs, 26361 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  0m53.8s/1m0s

running (0m54.8s), 1000/1000 VUs, 27015 complete and 0 interrupted iterations
default   [  91% ] 1000 VUs  0m54.8s/1m0s

running (0m55.8s), 1000/1000 VUs, 27630 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  0m55.8s/1m0s

running (0m56.8s), 1000/1000 VUs, 28059 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  0m56.8s/1m0s

running (0m57.8s), 1000/1000 VUs, 28825 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  0m57.8s/1m0s

running (0m58.8s), 1000/1000 VUs, 29409 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  0m58.8s/1m0s

running (0m59.8s), 1000/1000 VUs, 29940 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  0m59.8s/1m0s

running (1m00.8s), 0528/1000 VUs, 30437 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m01.5s), 0000/1000 VUs, 30965 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m0s

     ✓ status is 200

     checks.........................: 100.00% ✓ 30965      ✗ 0     
     data_received..................: 31 MB   501 kB/s
     data_sent......................: 1.7 MB  27 kB/s
     http_req_blocked...............: avg=73.49ms  min=158ns    med=361ns    max=7.04s   p(90)=762ns    p(95)=1.35µs  
     http_req_connecting............: avg=17ms     min=0s       med=0s       max=3.11s   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=678.78ms min=237.56ms med=348.43ms max=7.77s   p(90)=1.16s    p(95)=2.31s   
       { expected_response:true }...: avg=678.78ms min=237.56ms med=348.43ms max=7.77s   p(90)=1.16s    p(95)=2.31s   
     http_req_failed................: 0.00%   ✓ 0          ✗ 30965 
     http_req_receiving.............: avg=401.98µs min=14.76µs  med=52.27µs  max=1.05s   p(90)=533.69µs p(95)=1.34ms  
     http_req_sending...............: avg=71.91µs  min=20.83µs  med=48.28µs  max=40.66ms p(90)=104.41µs p(95)=150.13µs
     http_req_tls_handshaking.......: avg=55.87ms  min=0s       med=0s       max=6.75s   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=678.3ms  min=237.47ms med=348.11ms max=7.77s   p(90)=1.16s    p(95)=2.31s   
     http_reqs......................: 30965   503.890805/s
     iteration_duration.............: avg=1.96s    min=1.24s    med=1.64s    max=11.29s  p(90)=2.3s     p(95)=3.32s   
     iterations.....................: 30965   503.890805/s
     vus............................: 528     min=528      max=1000
     vus_max........................: 1000    min=1000     max=1000